ru = {
    # Основа
    'startm': 'Используйте "help" для получения дополнительной информации',
    'helpm': 'Приветствую! Данное приложение использует мой консольный движок.\nИспользуйте команду "help list" чтобы увидеть список всех команд.\nЧтобы получить информацию по отдельной команде используйте "help название_команды"',
    'helpl': 'Список всех команд:',
    'uncom': 'Неизвестная команда: ',
    'incorectm': 'Неправильная команда!',

    # Конфигурация
    'updateconf': 'Настройки были применены и сохранены.',
    'confs': 'Настройка конфигурации:',
    'confselect': 'Введите название параметра, который хотите изменить\n(чтобы пропустить нажмите enter)\n-> ',
    'confnew': 'Введите новое значение параметра:\n-> ',
    'confnotfound': 'Данного параметра не существует',
    'confincor': 'Данный тип не поддерживается',

    # Команды
    'admin': 'для работы администратора',
    'help': 'вывод справки, используйте "help l" для вывода всех команд',
    'stop': 'останавливает работу приложения',
    'config': 'открытие настроек',
    'init': 'инициализация базы паролей',
    'add': 'добавить пароль по сохраненым меткам',
    'remove': 'удалить пароль по меткам',
    'list': 'список всех паролей',
    'view': 'показать пароль и скопировать в буфер обмена',

    # Пути
    'necf': 'Путь не найден.\n',
    'necs': '\nПроверьте путь!',
    'necA': 'Попробовать еще раз? [Y - n]\n',
    'excf': 'Путь уже существует.\n',
    'excA': 'Попробовать еще раз? [Y - n]\n',

    # init
    'havekey': 'Для шифрования данных требуется ключ шифрования.',
    'havekeyA': 'У вас есть ключ? [Y - да / n - нет] ',
    'genkey': 'Предлагаю ключ:\n',
    'genkeyA': 'Оставляем таким [Y] или создать новый [n]\n',
    'savekeyA': 'Приложению сохранить ключ? [Y - да / n - нет]\nРекомендуется НЕ сохранять данные по расположению ключа\n',
    'waytokey': 'Введите путь где сохранить ключ:',
    'waynotexis': 'Данного пути не существует:\n',
    'waynotexisA': 'Создать его? [Y / n] ',
    'waynotempty': 'Указанная папка не пуста! Продолжить? [Y / n] ',
    'savekeyHere': 'Ключ сохранен в дирикторию с приложением! Переместите его в другое место или на флешку!',
    'hidekey': 'Спрятать ключ? [Y / n] ',
    'waytopass': 'Введите путь где сохранить папку с паролями\nВнимание! Папка будет скрыта для обычных пользователей\n',
    'allisready': 'Все ГОТОВО! Добавьте пароль командой add',

    # Load key
    'loadkey': 'Введите расположение ключа:',

    # ADD
    'addf': 'Введите метки сохранений через пробел:\n',
    'passinp': 'Введите пароль: ',

    # REMOVE
    'rmf': 'Введите метки пароля:\n',
    'rmA': 'Вы уверены? [Y / n]\n',
    'rmR': 'Удаление отменено!',

    # LIST
    'lstF': 'Все метки паролей:',
}

en = {
    # Main
    'startm': 'Use "help" command for more info',
    'helpm': 'Hi! This app is using my consol engine.\nUse "help list" (or "l") for show all commands or "help and name of command" for info about command',
    'helpl': 'List of all comands:',
    'uncom': 'Unknown command: ',
    'incorectm': 'Wrong command!',

    # Config
    'updateconf': 'Settings have been applied and saved.',
    'confs': 'Configurate settings:',
    'confselect': 'Enter the name of the parameter you want to change\n(press enter to skip)\n-> ',
    'confnew': 'Enter a new parameter value:\n-> ',
    'confnotfound': 'This parameter does not exist',
    'confincor': 'This type is not supported',

    # Commands
    'admin': 'only for admin work',
    'help': 'help output, use "help l" to list all commands',
    'stop': 'stops the application',
    'config': 'open settings',

    # init
    'havekey': 'Для шифрования данных требуется ключ шифрования.',
    'havekeyA': 'У вас есть ключ? [Y - да / n - нет]',
    'genkey': 'Предлагаю ключ:\n',
    'genkeyA': 'Оставляем таким [Y] или создать новый [n]\n',
    'savekeyA': 'Приложению сохранить ключ? [Y - да / n - нет]\nРекомендуется НЕ сохранять данные по расположению ключа\n',
    'waytokey': 'Введите путь где сохранить ключ:',
    'waynotexis': 'Данного пути не существует:\n',
    'waynotexisA': 'Создать его? [Y / n]\n',
    'waynotempty': 'Указанная папка не пуста! Продолжить? [Y / n]',
    'savekeyHere': 'Ключ сохранен в дирикторию с приложением! Переместите его в другое место или на флешку!',
    'hidekey': 'Спрятать ключ? [Y / n]',
    'waytopass': 'Введите путь где сохранить папку с паролями\nВнимание! Папка будет скрыта для обычных пользователей\n',
    'allisready': 'Все ГОТОВО! Добавьте пароль командой add',
    
}
